Repository: glv2/ofdm-transfer
Catalog: po/*.po
Languages: fr

source: Stopping (signal %d)
fr: Arrêt (signal %d)

source: Usage: ofdm-transfer [options] [filename]
fr: Usage: ofdm-transfer [options] [fichier]

source: Use audio samples instead of IQ samples.
fr: Utiliser des échantillons audio au lieu d'échantillons IQ.

source: -b <bit rate> (default: 38400 b/s)
fr: -b <débit> (défaut: 38400 b/s)

source: Bit rate of the OFDM transmission.
fr: Débit binaire de la transmission OFDM.

source: -c <ppm> (default: 0.0, can be negative)
fr: -c <ppm> (défaut: 0.0, peut être négative)

source: Correction for the radio clock.
fr: Correction pour l'horloge de la radio.

source: -d <filename>
fr: -d <fichier>

source: Dump a copy of the samples sent to or received from the radio.
fr: Enregistrer une copie des échantillons envoyés à ou reçus de la radio.

source: -e <fec[,fec]> (default: h128,none)
fr: -e <fec[,fec]> (défaut: h128,none)

source: Inner and outer forward error correction codes to use.
fr: Codes de correction d'erreurs interne et externe à utiliser.

source: -f <frequency> (default: 434000000 Hz)
fr: -f <fréquence> (défaut: 434000000 Hz)

source: Frequency of the OFDM transmission.
fr: Fréquence de la transmission OFDM.

source: -g <gain> (default: 0)
fr: -g <gain> (défaut: 0)

source: Gain of the radio transceiver, or audio gain in dB.
fr: Gain de l'émetteur-récepteur radio, ou gain audio en dB.

source: This help.
fr: Cette aide.

source: -i <id> (default: "")
fr: -i <id> (défaut: "")

source: Transfer id (at most 4 bytes). When receiving, the frames with a different id will be ignored.
fr: Id du transfert (au plus 4 octets). Lors de la réception, les trames avec un id différent seront ignorées.

source: -m <modulation> (default: qpsk)
fr: -m <modulation> (défaut: qpsk)

source: Modulation to use for the subcarriers.
fr: Modulation à utiliser pour les sous-porteuses.

source: -n <subcarriers[,cyclic prefix[,taper]]> (default: 64,16,4)
fr: -n <sous-porteuses[,préfixe cyclique[,effilage]]> (défaut: 64,16,4)

source: Number of subcarriers, cyclic prefix length and taper length of the OFDM transmission.
fr: Nombre de sous-porteuses, longueur du préfixe cyclique et longueur d'effilage de la transmission OFDM.

source: -o <offset> (default: 0 Hz, can be negative)
fr: -o <décalage> (défaut: 0 Hz, peut être négatif)

source: Set the central frequency of the transceiver 'offset' Hz lower than the signal frequency to send or receive.
fr: Mettre la fréquence centrale de l'émetteur-récepteur 'décalage' Hz plus bas que la fréquence du signal à envoyer ou recevoir.

source: -r <radio> (default: "")
fr: -r <radio> (défaut: "")

source: Radio to use.
fr: Radio à utiliser.

source: -s <sample rate> (default: 2000000 S/s)
fr: -s <vitesse échantillonnage> (défaut: 2000000 S/s)

source: Sample rate to use.
fr: Vitesse d'échantillonnage à utiliser.

source: -T <timeout> (default: 0 s)
fr: -T <temporisation> (défaut: 0 s)

source: Number of seconds after which reception will be stopped if no frame has been received. A timeout of 0 means no timeout.
fr: Nombre de secondes après lesquelles la réception sera stoppée si aucune trame n'a été reçue. Une temporisation de 0 signifie aucune temporisation.

source: Use transmit mode.
fr: Utiliser le mode transmission.

source: Print debug messages.
fr: Afficher les messages de débogage.

source: -w <delay> (default: 0.0 s)
fr: -w <délai> (défaut: 0.0 s)

source: Wait a little before switching the radio off. This can be useful if the hardware needs some time to send the last samples it has buffered.
fr: Attendre un peu après avoir éteint la radio. Ceci peut être utile si le matériel a besoin de temps pour envoyer les derniers échantillons dans les tampons.

source: By default the program is in 'receive' mode. Use the '-t' option to use the 'transmit' mode.
fr: Par défaut le programme est en mode réception. Utilisez l'option '-t' pour utiliser le mode émission.

source: In 'receive' mode, the samples are received from the radio, and the decoded data is written either to 'filename' if it is specified, or to standard output. In 'transmit' mode, the data to send is read either from 'filename' if it is specified, or from standard input, and the samples are sent to the radio.
fr: En mode réception, les échantillons sont reçus de la radio, et les données décodées sont écrites soit vers 'fichier' si il est spécifié, ou vers la sortie standard. En mode émission, les données à envoyer sont lues soit de 'fichier' si il est spécifié, ou de l'entrée standard, et les échantillons sont envoyés à la radio.

source: Instead of a real radio transceiver, the 'io' radio type uses standard input in 'receive' mode, and standard output in 'transmit' mode. The 'file=path-to-file' radio type reads/writes the samples from/to 'path-to-file'. The IQ samples must be in 'complex float' format (32 bits for the real part, 32 bits for the imaginary part). The audio samples must be in 'signed integer' format (16 bits).
fr: Au lieu d'un émetteur-récepteur radio réel, le type de radio 'io' utilise l'entrée standard en mode réception, et la sortie standard en mode émission. Le type de radio 'file=chemin-vers-fichier' lit/écrit les échantillons de/vers 'chemin-vers-fichier'. Les échantillons IQ doivent avoir le format 'complex float' (32 bits pour la partie réelle, 32 bits pour la partie imaginaire). Les échantillons audio doivent avoir le format 'signed integer' (16 bits).

source: The gain parameter can be specified either as an integer to set a global gain, or as a series of keys and values to set specific gains (for example 'LNA=32,VGA=20'). When using the audio mode (with the '-a' option), the gain value in dB is applied to the audio samples.
fr: Le paramètre de gain peut être spécifié soit comme un entier pour définir un gain global, ou comme une série de clés et de valeurs pour définir des gains spécifiques (par exemple 'LNA=32,VGA=20'). Lorsque le mode audio est utilisé (avec l(option '-a'), la valeur de gain en dB est appliquée aux échantillons audio.

source: Available radios (via SoapySDR):
fr: Radios disponibles (via SoapySDR) :

source: Available subcarrier modulations:
fr: Modulations de sous-porteuse disponibles :

source: Available forward error correction codes:
fr: Codes de correction d'erreurs disponibles :

source: Error: Unknown parameter: '-%c %s'
fr: Erreur : Paramètre inconnu : '-%c %s'

source: Error: Failed to initialize transfer
fr: Erreur : Échec de l'initialisation du transfert

source: Error: %s
fr: Erreur : %s

source: Error: Memory allocation failed
fr: Erreur: Échec de l'allocation de mémoire

source: Frame %u for '%s': corrupted header
fr: Trame %u pour '%s' : en-tête corrompu

source: Frame %u for '%s': corrupted payload
fr: Trame %u pour '%s' : charge utile corrompue

source: Frame %u for '%s': ignored
fr: Trame %u pour '%s' : ignorée

source: Timeout: %d s without frames
fr: Temporisation : %d s sans trames

source: Error: Invalid sample rate
fr: Erreur : Vitesse d'échantillonnage non valide

source: Error: Invalid frequency
fr: Erreur : Fréquence non valide

source: Error: This radio type only supports IQ samples
fr: Erreur : Cette radio ne supporte que les échantillons IQ

source: Error: Invalid bit rate
fr: Erreur : Débit non valide

source: Error: Invalid subcarrier modulation
fr: Erreur : Modulation de sous-porteuse non valide

source: Error: Invalid number of subcarriers
fr: Erreur : Nombre de sous-porteuses non valide

source: Error: Invalid inner FEC
fr: Erreur : FEC interne non valide

source: Error: Invalid outer FEC
fr: Erreur : FEC externe non valide

source: Error: Id must be at most 4 bytes long
fr: Erreur : Id doit être long d'au plus 4 octets

source: Error: Failed to open '%s'
fr: Erreur : Échec de l'ouverture de '%s'

source: Error: Unknown radio type
fr: Erreur : Type de radio inconnu

source: Info: Using IO pseudo-radio
fr: Info : Utilisation de la pseudo-radio IO

source: Info: Using FILENAME pseudo-radio
fr: Info : Utilisation de la pseudo-radio FILENAME

source: No radio detected
fr: Pas de radio détectée
